In [1]:
# SQLite のモジュールをインポートする
import sqlite3
 
# Club.db に接続する
conn = sqlite3.connect("Club.db", isolation_level=None)

# "Members" テーブルを作成する (id, name, age, hometown) 
# VARCHAR: 可変長文字列型, INTEGER: 整数
sql="""
CREATE TABLE Members (
    id VARCHAR(4), 
    name VARCHAR(30), 
    age INTEGER, 
    hometown VARCHAR(20)
);
"""

conn.execute(sql)

#データを作り直したいときには、次のコマンドを実行し、
#conn.execute("DROP TABLE Members")
# 再度上記の "Members" テーブルを作成する

In [2]:
conn.execute("DROP TABLE Members")

In [3]:
# SQLite のモジュールをインポートする
import sqlite3
 
# Club.db に接続する
conn = sqlite3.connect("Club.db", isolation_level=None)

# "Members" テーブルを作成する (id, name, age, hometown) 
# VARCHAR: 可変長文字列型, INTEGER: 整数
sql="""
CREATE TABLE Members (
    id VARCHAR(4), 
    name VARCHAR(30), 
    age INTEGER, 
    hometown VARCHAR(20)
);
"""

conn.execute(sql)

# データを作り直したいときには、次のコマンドを実行し、
# conn.execute("DROP TABLE Members")
# 再度上記の "Members" テーブルを作成する

In [4]:
# データを登録する(1)
conn.execute("INSERT INTO Members VALUES (1001, '佐藤一郎', 25, '京都')")

# 次のように、SQL文を、いったん、、別の変数に格納してから、conn.execute(sql) とすることも可能
# sql = "INSERT INTO Members VALUES (1001, '佐藤一郎', 25, '京都')"
# conn.execute(sql)

In [5]:
# データを登録する(2)
conn.execute("INSERT INTO Members VALUES (1015, '鈴木花子', 40, '京都')")

In [6]:
# データを登録する(3)
conn.execute("INSERT INTO Members VALUES (1027, 'Mary Scott', 33, 'New York')")

In [7]:
# データを登録する(4)
conn.execute("INSERT INTO Members VALUES (1033, 'Kevin Nelson', 45, 'London')")

In [8]:
# データを登録する(5)
conn.execute("INSERT INTO Members VALUES (1038, '田中太郎', 37, '京都')")

In [9]:
# データを登録する(6)
conn.execute("INSERT INTO Members VALUES (1041, 'Jack Liu', 28, 'New York')")

In [10]:
# 登録したデータを取得して表示する
c=conn.cursor()
c.execute("SELECT * FROM Members")
for row in c:
    print(row)

('1001', '佐藤一郎', 25, '京都')
('1015', '鈴木花子', 40, '京都')
('1027', 'Mary Scott', 33, 'New York')
('1033', 'Kevin Nelson', 45, 'London')
('1038', '田中太郎', 37, '京都')
('1041', 'Jack Liu', 28, 'New York')

In [11]:
# 特定のレコードを取得する例
# 「京都」出身者のレコードを取得する
sql="SELECT * FROM Members WHERE hometown='京都'"
c=conn.execute(sql)
for row in c:
    print (row)

('1001', '佐藤一郎', 25, '京都')
('1015', '鈴木花子', 40, '京都')
('1038', '田中太郎', 37, '京都')

In [12]:
# 年齢の平均を計算する
sql="SELECT avg(age) FROM Members"
c.execute(sql)
row = c.fetchone()
print(row[0])

34.666666666666664

In [13]:
# 年齢の降順(descending order)に並べる
sql="SELECT name, age from Members ORDER BY age DESC"
c.execute(sql)
for row in c: 
    print (row)

('Kevin Nelson', 45)
('鈴木花子', 40)
('田中太郎', 37)
('Mary Scott', 33)
('Jack Liu', 28)
('佐藤一郎', 25)

In [14]:
# 年齢の昇順(ascending order)に並べる
sql="SELECT name, age from Members ORDER BY age ASC"
c.execute(sql)
for row in c: 
    print (row)

('佐藤一郎', 25)
('Jack Liu', 28)
('Mary Scott', 33)
('田中太郎', 37)
('鈴木花子', 40)
('Kevin Nelson', 45)

In [15]:
# 35歳未満のレコードを取得する
sql="SELECT * FROM Members WHERE age<35"
c.execute(sql)
for row in c: 
    print (row)

('1001', '佐藤一郎', 25, '京都')
('1027', 'Mary Scott', 33, 'New York')
('1041', 'Jack Liu', 28, 'New York')

In [16]:
# 年齢の最大値を表示する
sql="SELECT MAX(age) FROM Members"
c.execute(sql)
row = c.fetchone()
print(row[0])

45

In [17]:
# 年齢の最小値を表示する
sql="SELECT MIN(age) FROM Members"
c.execute(sql)
row = c.fetchone()
print(row[0])

25

In [18]:
# Members テーブルをhometown でグループ化して、hometownの名前と、それぞれのレコード数を取得する
sql= "SELECT hometown,count(*) FROM Members GROUP BY hometown"
c.execute(sql)
for row in c: 
    print (row)

('London', 1)
('New York', 2)
('京都', 3)